base/Documents/бит_му_ПринятиеКУчетуНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_ПринятиеКУчетуНМА</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_му_СостоянияНМА</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>InformationRegister.бит_му_ПараметрыНМА</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНРП</Name>
					<Comment>Счет нераспределенной прибыли</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НематериальныеАктивы</Name>
					<Comment>Нематериальные активы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НематериальныйАктив</Name>
							<Comment>Нематериальный актив</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Comment>Класс нематериального актива</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_му_КлассыНМА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПринятияКУчету</Name>
							<Comment>Дата принятия к учету</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Comment>Срок полезного использования</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимость</Name>
							<Comment>Первоначальная стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислятьАмортизацию</Name>
							<Comment>Начислять амортизацию</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислятьАмортизациюСТекущегоПериода</Name>
							<Comment>Начислять амортизацию с текущего периода</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодНачисленияАмортизации</Name>
							<Comment>Метод начисления амортизации</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_му_МетодыНачисленияАмортизацииНМА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисленнойАмортизации</Name>
							<Comment>Сумма начисленной амортизации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияРасходовПоАмортизации</Name>
							<Comment>Способ отражения расходов по амортизации</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_му_СпособыОтраженияРасходовПоАмортизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентУскорения</Name>
							<Comment>Коэффициент ускорения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНачисленияАмортизации</Name>
							<Comment>Счет начисления амортизации</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредполагаемыйОбъемПродукции</Name>
							<Comment>Предполагаемый объем продукции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияОбъемаПродукции</Name>
							<Comment>Ед. изм. объема продукции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРезерваПереоценки</Name>
							<Comment>Счет резерва переоценки</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСниженияСтоимости</Name>
							<Comment>Счет снижения стоимости</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>Аналитика счета учета 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>Аналитика счета учета 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>Аналитика счета учета 3</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто4</Name>
							<Comment>Аналитика счета учета 4</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСчет</Name>
							<Comment>(МСФО)</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто1</Name>
							<Comment>Аналитика кор счета 1</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто2</Name>
							<Comment>Аналитика кор счета 2</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто3</Name>
							<Comment>Аналитика кор счета 3</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто4</Name>
							<Comment>Аналитика кор счета 4</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/InformationRegisters/бит_му_СостоянияНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_му_СостоянияНМА</Name>
			<Comment>(БИТ МУ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Comment>Дата состояния</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Comment>Нематериальный актив</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_СостоянияНМА</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/бит_му_ПараметрыНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_му_ПараметрыНМА</Name>
			<Comment>(БИТ МУ)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПараметра</Name>
					<Comment>Значение параметра</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_му_ВидыПараметровВНА</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Comment>Нематериальный актив</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Comment>Параметр</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_му_ВидыПараметровВНА</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_му_СостоянияНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_СостоянияНМА</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоКУчету</Name>
					<Comment>Принято к учету</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>Снято с учета</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_му_ПринятиеКУчетуНМА/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мВалютаМеждУчета Экспорт; // Хранит валюту международного учета

Перем мКоличествоСубконтоМУ Экспорт; // Хранит количество субконто международного учета в документа.

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаПроведения".
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Переменная, хранящее структуру шапки документа.
	Перем СтруктураШапкиДокумента;
	

	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект, Ложь) Тогда
		Возврат
	КонецЕсли;
	
	// Подготовим структуру шапки документа.
	ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	// Получим структуру курсов валют.
	СтруктураКурсыВалют = КурсыВалют(СтруктураШапкиДокумента, Отказ, Заголовок);
		
	// Подготовим таблицы для возможности проведения.
	СтруктураТаблиц = ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, СтруктураКурсыВалют);
	
	// Получим структуру курсов на даты принятия к учету.
	ИсторическиеКурсы = ИсторическиеКурсыВалют(СтруктураТаблиц.НМА, СтруктураКурсыВалют);

	// Проверить заполнение таблиц.
	ПроверитьЗаполнениеТаблицДокумента(СтруктураТаблиц, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, СтруктураКурсыВалют, ИсторическиеКурсы, Отказ, Заголовок);
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
// 
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);

КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
// 
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	
		
КонецПроцедуры // ПриЗаписи()

Процедура ПриКопировании(ОбъектКопирования)
	
	ЗаполнитьШапкуДокумента(ОбъектКопирования);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		
		// Заполнение нового документа
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
			Если ЗначениеЗаполнено(ВалютаДокумента) Тогда
				ИзменениеВалютыМодуль();			
			КонецЕсли;
			                                          			
			Если ДанныеЗаполнения.Свойство("ТаблицаВНА") Тогда
				
				ТипНМА = Тип("СправочникСсылка.НематериальныеАктивы");
				
				// Метод начисления амортизации по умолчанию
				ЛинейныйМетодНачисления = Перечисления.бит_му_МетодыНачисленияАмортизацииНМА.Линейный;
				// Параметр "НачислятьАмортизациюСТекущегоПериодаНМА" извлекается из учетной политики.
	    		ДанныеУчетнойПолитики = бит_му_ОбщегоНазначения.ПолучитьУчетнуюПолитику(Дата, Новый Структура("Организация", Организация));
				НачислятьАмортизациюСТекущегоПериода = бит_ОбщегоНазначения.НастройкаПрограммы(
				ДанныеУчетнойПолитики
												, ПланыВидовХарактеристик.бит_му_ВидыПараметровУчетнойПолитики.НачислятьАмортизациюСТекущегоПериодаНМА);
	                                                   				
				Для каждого СтрокаТаблицы Из ДанныеЗаполнения.ТаблицаВНА Цикл
													
					СтрТч = НематериальныеАктивы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрТч, СтрокаТаблицы);
			
					СтрТч.НематериальныйАктив = СтрокаТаблицы.ВНА;								

					// Действия при начале редактирования строки НМА
					СтрТч.НачислятьАмортизацию       		   = Истина;
					СтрТч.МетодНачисленияАмортизации 		   = ЛинейныйМетодНачисления;	                 	
					СтрТч.НачислятьАмортизациюСТекущегоПериода = НачислятьАмортизациюСТекущегоПериода;
												
					// Класс по умолчанию
					ЗаполнитьКлассПоУмолчаниюМодуль(СтрТч);
					
					НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(СтрТч.СчетУчета, мКоличествоСубконтоМУ);									  
	 				бит_БухгалтерскийУчет.ПривестиЗначенияСубконто(СтрТч, НастройкиСубконто, "Субконто");

					// Значения субконто НМА
					Если ЗначениеЗаполнено(СтрТч.НематериальныйАктив) Тогда 																
						Для Ном = 1 По мКоличествоСубконтоМУ Цикл 								
							ТекИмяСубконто = "Субконто" + Ном;  								
							Если ТипЗнч(СтрТч[ТекИмяСубконто]) = ТипНМА Тогда
								СтрТч[ТекИмяСубконто] = СтрТч.НематериальныйАктив;
							КонецЕсли;          							
						КонецЦикла;  						
					КонецЕсли;
					
					СтрТч.КорСчет = ДанныеЗаполнения.КорСчет;
				
				КонецЦикла;  		
			
			КонецЕсли;  	
			
		КонецЕсли;
						
	КонецЕсли;
	
	ЗаполнитьШапкуДокумента();
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверим наличие суммы начисленной ранее амортизации.
	Если Не НематериальныеАктивы.Итог("СуммаНачисленнойАмортизации") = 0 Тогда
		
		Если Не ЗначениеЗаполнено(СчетНРП) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнено значение реквизита ""Счет нераспределенной прибыли"".'; 
			                      |en = 'The value of the attribute ""retained earnings account"" isn’t filled.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,"СчетНРП",,Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверим заполнение таб.части НематериальныеАктивы.
	
	ОбязательныеПоляАмортизации = Новый Структура;
	
	ОбязательныеПоляАмортизации.Вставить("МетодНачисленияАмортизации", НСтр("ru='Метод начисления амортизации';en='Depreciation Method'"));
	ОбязательныеПоляАмортизации.Вставить("СпособОтраженияРасходовПоАмортизации", 
										 НСтр("ru='Способ отражения расходов по амортизации';en='Amortization Expense Recognition Method'"));
	ОбязательныеПоляАмортизации.Вставить("СчетНачисленияАмортизации", НСтр("ru='Счет начисления амортизации';en='Amortization Account'"));
	
	Для Каждого ТекущаяСтрока Из НематериальныеАктивы Цикл
		
		Ном = ТекущаяСтрока.НомерСтроки-1;
		
		Если ТекущаяСтрока.НачислятьАмортизацию Тогда
			
			Для Каждого ТекущееПоле Из ОбязательныеПоляАмортизации Цикл
				
				Если Не ЗначениеЗаполнено(ТекущаяСтрока[ТекущееПоле.Ключ]) Тогда
					ТекстСообщения = НСтр("ru='Не заполнено значение реквизита ""%1"".';en='Value of detail ""%1"" is empty'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущееПоле.Значение);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,"НематериальныеАктивы["+Ном+"]."+ТекущееПоле.Ключ,,Отказ);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураНеДублирующихсяПолей = Новый Структура;
	СтруктураНеДублирующихсяПолей.Вставить("НематериальныйАктив");
																		 
	////////////////////////////////////////////////////////////////////////////////
	// Таблица "НематериальныеАктивы"
	
	ТекстКритерий1 = "СтрокаТаблицы.НачислятьАмортизацию";
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("СрокПолезногоИспользования", ТекстКритерий1);

	бит_ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект
															, "НематериальныеАктивы"
															, СтруктураОбязательныхПолей
															, Отказ
															, Заголовок);
															
	////////////////////////////////////////////////////////////////////////////////
	// Проверим наличие дублей в табличной части "НематериальныеАктивы".
	бит_ОбщегоНазначения.ПроверитьДублированиеЗначенийВТабличнойЧасти(ЭтотОбъект
																	 , "НематериальныеАктивы"
																	 , СтруктураНеДублирующихсяПолей
																	 , Отказ
																	 , Заголовок);
																 
																	 
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура синхронизирует реквизиты строки НМА с аналитикой счетов.
// 
// Параметры:
//  ТекущаяСтрока - СтрокаТабличнойЧасти.НематериальныеАктивы.
//  ИмяСубконто   - Строка.
// 
Процедура СинхронизироватьРеквизитыСтрокиНМА(ТекущаяСтрока, ИмяСубконто) Экспорт
	
	Если ТекущаяСтрока = Неопределено Тогда
		 Возврат;
	КонецЕсли; 

	Если ЗначениеЗаполнено(ТекущаяСтрока.НематериальныйАктив) Тогда
		
		ТипОС = Тип("СправочникСсылка.НематериальныеАктивы");
		
		Для Ном = 1 По мКоличествоСубконтоМУ Цикл
			
			ТекИмяСубконто = ИмяСубконто + Ном;
			
			Если ТипЗнч(ТекущаяСтрока[ТекИмяСубконто]) = ТипОС Тогда
				 ТекущаяСтрока[ТекИмяСубконто] = ТекущаяСтрока.НематериальныйАктив;
			 КонецЕсли; 
		
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры // СинхронизироватьРеквизитыСтрокиНМА()

// Процедура обрабатывает изменение валюты документа.
// 
// Параметры:
//  Нет.
// 
Процедура ИзменениеВалютыМодуль() Экспорт

	СтруктураКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	
	КурсДокумента      = СтруктураКурса.Курс;
	КратностьДокумента = СтруктураКурса.Кратность;

КонецПроцедуры // ИзменениеВалютыМодуль()

// бит_ASubbotina Процедура обрабатывает изменение класса в строке табличной части.
// 
// Параметры:
//  ТекущиеДанные - СтрокаТабличнойЧасти.НематериальныеАктивы.
//  ВызовИзФормы  - Булево (По умолчанию = Ложь).
// 
Процедура ИзменениеКлассаМодуль(ТекущиеДанные, ВызовИзФормы = Ложь) Экспорт

	Если ТекущиеДанные = Неопределено Тогда	
		Возврат; 	
	КонецЕсли; 
		
	Если ЗначениеЗаполнено(ТекущиеДанные.Класс) Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Организация);
		СтруктураПараметров.Вставить("Класс"      , ТекущиеДанные.Класс);
		
		ПараметрыКласса   = бит_му_ВНА.ПолучитьПараметрыКлассаВНА(СтруктураПараметров);
		МетаданныеОбъекта = Ссылка.Метаданные();
		
		Для Каждого ТекПараметр Из ПараметрыКласса Цикл
			
			ИмяКолонки 		  = ТекПараметр.Ключ;
			ЗначениеПараметра = ТекПараметр.Значение;
			
			Если бит_РаботаСМетаданными.ЕстьРеквизитТабЧасти(ИмяКолонки, МетаданныеОбъекта, "НематериальныеАктивы") Тогда
				
				Если СтрСравнить(ИмяКолонки, "СрокПолезногоИспользования") = 0 И ЗначениеПараметра = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ТекущиеДанные[ИмяКолонки] = ЗначениеПараметра;
				
				Если ИмяКолонки = "СчетУчета" И НЕ ВызовИзФормы Тогда
					НастройкиСубконто = бит_БухгалтерскийУчет.ПолучитьНастройкиСубконто(ТекущиеДанные.СчетУчета, мКоличествоСубконтоМУ);
					бит_БухгалтерскийУчет.ПривестиЗначенияСубконто(ТекущиеДанные, НастройкиСубконто, "Субконто");
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; // Если ЗначениеЗаполнено(ТекущаяСтрока.Класс) Тогда.

КонецПроцедуры // ИзменениеКлассаМодуль()

// Процедура заполняет класс по умолчанию.
// 
// Параметры:
//  ТекущиеДанные - СтрокаТабличнойЧасти.НематериальныеАктивы.
// 
Процедура ЗаполнитьКлассПоУмолчаниюМодуль(ТекущиеДанные) Экспорт

	Если ТекущиеДанные = Неопределено Тогда		
		Возврат;		
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(ТекущиеДанные.НематериальныйАктив) И НЕ ЗначениеЗаполнено(ТекущиеДанные.Класс) Тогда
		
		 // Определяем класс по виду НМА и организации.
	     КлассПоУмолчанию = бит_му_ВНА.ПолучитьКлассВНА(ТекущиеДанные.НематериальныйАктив.ВидНМА, Организация);
		 Если ЗначениеЗаполнено(КлассПоУмолчанию) Тогда
		 
		 	ТекущиеДанные.Класс = КлассПоУмолчанию;
			ИзменениеКлассаМодуль(ТекущиеДанные);
		 
		 КонецЕсли; 
	
	 КонецЕсли;
	
КонецПроцедуры // ЗаполнитьКлассПоУмолчаниюМодуль()

// Процедура формирует структуру шапки документа и дополнительных полей.
// 
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, Отказ) Экспорт

	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
КонецПроцедуры

// Функция готовит таблицы документа для проведения.
// 
// Возвращаемое значение:
//   СтруктураТаблиц - Структура.
// 
Функция ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, СтруктураКурсыВалют)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"			, Ссылка);
	Запрос.УстановитьПараметр("Организация"		, СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("СостояниеПринято", Перечисления.бит_му_СостоянияНМА.ПринятоКУчету);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабЧасть.НомерСтроки,
	|	ТабЧасть.НематериальныйАктив,
	|	ТабЧасть.ДатаПринятияКУчету,
	|	ТабЧасть.СрокПолезногоИспользования,
	|	ТабЧасть.ПервоначальнаяСтоимость,
	|	ТабЧасть.НачислятьАмортизацию,
	|	ТабЧасть.НачислятьАмортизациюСТекущегоПериода,
	|	ТабЧасть.МетодНачисленияАмортизации,
	|	ТабЧасть.СуммаНачисленнойАмортизации,
	|	ТабЧасть.СпособОтраженияРасходовПоАмортизации,
	|	ТабЧасть.КоэффициентУскорения,
	|	ТабЧасть.СчетНачисленияАмортизации,
	|	ТабЧасть.ПредполагаемыйОбъемПродукции,
	|	ТабЧасть.ЕдиницаИзмеренияОбъемаПродукции,
	|	ТабЧасть.Сумма,
	|	ТабЧасть.СчетРезерваПереоценки,
	|	ТабЧасть.СчетСниженияСтоимости,
	|	ТабЧасть.СчетУчета,
	|	ТабЧасть.Субконто1,
	|	ТабЧасть.Субконто2,
	|	ТабЧасть.Субконто3,
	|	ТабЧасть.Субконто4,
	|	ТабЧасть.КорСчет,
	|	ТабЧасть.КорСубконто1,
	|	ТабЧасть.КорСубконто2,
	|	ТабЧасть.КорСубконто3,
	|	ТабЧасть.КорСубконто4,
	|	ТабЧасть.Класс,
	|	СостоянияНМА.Состояние,
	|	СостоянияНМА.ДатаСостояния
	|ИЗ
	|	Документ.бит_му_ПринятиеКУчетуНМА.НематериальныеАктивы КАК ТабЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_му_СостоянияНМА КАК СостоянияНМА
	|		ПО ТабЧасть.НематериальныйАктив = СостоянияНМА.НематериальныйАктив
	|			И (СостоянияНМА.Организация = &Организация)
	|			И (СостоянияНМА.Состояние = &СостояниеПринято)
	|ГДЕ
	|	ТабЧасть.Ссылка = &Ссылка";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаПоНМА = РезультатЗапроса.Выгрузить();
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("НМА", ТаблицаПоНМА);
	
	Возврат СтруктураТаблиц;
	
КонецФункции // ПодготовитьТаблицыДокумента()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьШапкуДокумента(ОбъектКопирования=Неопределено)
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();	
	КонецЕсли; 	
	
	// Заполним шапку документа значениями по умолчанию.
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), ОбъектКопирования);
	
	// Заполним счет нераспределенной прибыли из учетной политики.
	Если ОбъектКопирования = Неопределено Тогда
		СчетНРП = бит_му_ОбщегоНазначения.ПолучитьСчетНРП(Организация, Дата);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		ВалютаДокумента = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Организация);		
		СтруктураКурса     = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента, ТекущаяДатаСеанса()); 		
		КурсДокумента      = СтруктураКурса.Курс;
		КратностьДокумента = СтруктураКурса.Кратность;
	КонецЕсли;

КонецПроцедуры

// Процедура проверяет правильность заполнения строк таблиц документа.
// 
// Параметры: 
//  СтруктураТаблиц			- Структура, таблицы значений, содержащая данные для проведения и проверки.
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа.
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
// 
Процедура ПроверитьЗаполнениеТаблицДокумента(СтруктураТаблиц, СтруктураШапкиДокумента, Отказ, Заголовок)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПоНМА = СтруктураТаблиц.НМА;
	
	// Проверим таблицу НМА по строчно.
	Для Каждого ТекСтрока Из ТаблицаПоНМА Цикл
	
		Если ЗначениеЗаполнено(ТекСтрока.Состояние) Тогда
			
			ТекстСообщения = НСтр("ru = 'В строке №%1 табличной части ""Нематериальные активы"" указан нематериальный актив ""%2"" принятый к учету %3. Повторное принятие к учету невозможно.'; 
			                      |en = 'In line №%1 of the tabular part ""Intangible assets"" is indicated the intangible asset ""%2"" accepted for accounting %3. Re-acceptance for accounting is not possible.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, 
								ТекСтрока.НомерСтроки, ТекСтрока.НематериальныйАктив, Формат(ТекСтрока.ДатаСостояния, "ДЛФ=DT"));				 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			
		КонецЕсли; 
	
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТаблицДокумента()

// Процедура выполняет движения по регистрам.
// 
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, СтруктураКурсыВалют, ИсторическиеКурсы, Отказ, Заголовок)
	
	ТекОрганизация   = СтруктураШапкиДокумента.Организация;
	СостояниеПринято = Перечисления.бит_му_СостоянияНМА.ПринятоКУчету;
	ТаблицаДанных    = СтруктураТаблиц.НМА;
	
	НаборЗаписей_МУ 	     = Движения.бит_Дополнительный_2;
	НаборЗаписей_Состояние   = Движения.бит_му_СостоянияНМА;
	ТаблицаЗаписей_Состояние = НаборЗаписей_Состояние.Выгрузить();
	
	ТаблицаЗаписей_Состояние.Очистить();
	
	// Выполним движения.
	ВыполнитьДвижения(СтруктураШапкиДокумента
					 ,ТаблицаДанных
					 ,СтруктураКурсыВалют
					 ,ИсторическиеКурсы
					 ,НаборЗаписей_МУ
					 ,ТаблицаЗаписей_Состояние);
					 
	// Выполним движения по регистру параметров НМА.
	ВыполнитьДвиженияПоРегиструПараметровНМА(СтруктураШапкиДокумента, ТаблицаДанных, ИсторическиеКурсы);
	
	ТаблицаЗаписей_Состояние.ЗаполнитьЗначения(Истина          , "Активность");	
	ТаблицаЗаписей_Состояние.ЗаполнитьЗначения(ТекОрганизация  , "Организация");
	ТаблицаЗаписей_Состояние.ЗаполнитьЗначения(СостояниеПринято, "Состояние");
	
	НаборЗаписей_Состояние.Загрузить(ТаблицаЗаписей_Состояние);
	
КонецПроцедуры // ДвиженияПоРегистрам()

// Процедура выполняет движения.
// 
// Параметры: 
//  СтруктураШапкиДокумента  - Структура.
//  ТаблицаДанных			 - ТаблицаЗначений.
//  СтруктураКурсыВалют      - Структура.
//  НаборЗаписей_МУ			 - РегистрБухгалтерииНаборЗаписей.бит_Дополнительный_2.
//  ТаблицаЗаписей_Состояние - ТаблицаЗначений.
// 
Процедура ВыполнитьДвижения(СтруктураШапкиДокумента
						   ,ТаблицаДанных
						   ,СтруктураКурсыВалют
						   ,ИсторическиеКурсы
						   ,НаборЗаписей_МУ
						   ,ТаблицаЗаписей_Состояние)
						   
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		// ДТ СчетУчета КТ КорСчет Сумма
		Содержание = НСтр("ru = 'Принятие к учету НМА'; en = 'Acceptance of intangible assets'");
		СоздатьЗаписьПоПринятиюКУчету(СтруктураШапкиДокумента
									 ,НаборЗаписей_МУ
									 ,СтрокаТаблицы
									 ,ИсторическиеКурсы[СтрокаТаблицы.ДатаПринятияКУчету]
									 ,СтрокаТаблицы.Сумма
									 ,Содержание);
									 
		// ДТ СчетНРП КТ СчетНачисленияАмортизации СуммаНачисленнойАмортизации.
		Содержание = НСтр("ru = 'Начисленная амортизация НМА'; en = 'Accrued depreciation of intangible assets'");
		СоздатьЗаписьПоНачисленюРаннейАмортизации(СтруктураШапкиДокумента
												 ,НаборЗаписей_МУ
												 ,СтрокаТаблицы
												 ,ИсторическиеКурсы[СтрокаТаблицы.ДатаПринятияКУчету]
												 ,СтрокаТаблицы.СуммаНачисленнойАмортизации
												 ,Содержание);
			
		// Добавим состояние по НМА.
		ЗаписьСостояние = ТаблицаЗаписей_Состояние.Добавить();
		ЗаписьСостояние.НематериальныйАктив = СтрокаТаблицы.НематериальныйАктив;
		ЗаписьСостояние.ДатаСостояния       = СтрокаТаблицы.ДатаПринятияКУчету;
		
	КонецЦикла; // Обход таблицы НМА.
							 
КонецПроцедуры // ВыполнитьДвижения()

// Функция получает структуру курсов валют.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  Отказ					- Булево.
//  Заголовок				- Строка.
// 
// Возвращаемое значение:
//  СтруктураКурсыВалют - Структура.
// 
Функция КурсыВалют(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ВидыКурсов = Новый Структура("Упр, Регл, МУ, Документ");
	СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ЭтотОбъект, СтруктураШапкиДокумента.Дата, ВидыКурсов);
	
	// Получим валюту международного учета.
	СтрКурсов = СтруктураКурсыВалют.МУ;
	мВалютаМеждУчета = СтрКурсов.Валюта;
	
	Если Не ЗначениеЗаполнено(мВалютаМеждУчета) Тогда
		
		ТекстСообщения = НСтр("ru = 'Для организации ""%1"" не указана валюта международного учета.'; 
		                      |en = 'The organization ""%1"" does not have an international accounting currency.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, СтруктураШапкиДокумента.Организация);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
		Возврат Новый Структура;
	КонецЕсли;
	
	Возврат СтруктураКурсыВалют;
	
КонецФункции // КурсыВалют()

// Функция получает курсы валют на даты принятия к учету НМА.
// 
// Параметры:
// 	ТаблицаДанных - ТаблицаЗначений - таблица данных по НМА
// 	СтруктураКурсыВалют - Структура - курсы валют на дату документа.
// 
// Возвращаемое значение:
// 	Курсы - Соответствие - значения курсов на дату принятия к учету 
// 						   будут иметь аналогичную структуру как и СтруктураКурсыВалют.
// 
Функция ИсторическиеКурсыВалют(ТаблицаДанных, СтруктураКурсыВалют)
	
	ТаблицаПериодов = ТаблицаДанных.Скопировать(, "ДатаПринятияКУчету");
	ТаблицаПериодов.Колонки.ДатаПринятияКУчету.Имя = "Период";
	ТаблицаПериодов.Свернуть("Период");
	
	Курсы = бит_КурсыВалют.ПолучитьКурсыВалютПоПериодам(ТаблицаПериодов, СтруктураКурсыВалют);
	
	Возврат Курсы;
	
КонецФункции

// Процедура формирует движения по параметрам НМА.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  ТаблицаДанных			- ТаблицаЗначений.
// 	ИсторическиеКурсы		- Соответствие.
// 
Процедура ВыполнитьДвиженияПоРегиструПараметровНМА(СтруктураШапкиДокумента, ТаблицаДанных, ИсторическиеКурсы)
	
	МенеджерПВХ = ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА;
	
	// Движения по регистру сведений "бит_му_ПараметрыНМА".
	НаборЗаписей_Параметры = Движения.бит_му_ПараметрыНМА;
	
	ВидыПараметров = бит_му_ВНА.ПолучитьВидыПараметров(ПланыВидовХарактеристик.бит_му_ВидыПараметровВНА.НематериальныеАктивы);
	
	// Выполним запись параметров НМА.
	бит_му_ВНА.ЗаписатьПараметрыВНА(НаборЗаписей_Параметры, СтруктураШапкиДокумента, ТаблицаДанных, ВидыПараметров, "НМА");
	
	// Добавим параметры по историческим курсам
	Для Каждого ТекущаяСтрока Из ТаблицаДанных Цикл
		
		КурсыНаПериод = ИсторическиеКурсы[ТекущаяСтрока.ДатаПринятияКУчету];
		
		Если КурсыНаПериод = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ТекущаяВалюта Из КурсыНаПериод Цикл
			ПараметрыВалюты = ТекущаяВалюта.Значение;
			
			Для Каждого ПараметрВалюты Из ПараметрыВалюты Цикл
				Параметр = ВидыПараметров[ПараметрВалюты.Ключ+ТекущаяВалюта.Ключ+"_НМА"];
				
				Если НЕ ЗначениеЗаполнено(Параметр) Тогда
					Продолжить;
				КонецЕсли;
				
				Запись = НаборЗаписей_Параметры.Добавить();
				Запись.Регистратор      = СтруктураШапкиДокумента.Ссылка;
				Запись.Период           = СтруктураШапкиДокумента.Дата;
				Запись.Организация		= СтруктураШапкиДокумента.Организация;
				Запись.НематериальныйАктив = ТекущаяСтрока.НематериальныйАктив;
				
				Запись.Параметр         = Параметр;
				Запись.ЗначениеПараметра= ПараметрВалюты.Значение;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьДвиженияПоРегиструПараметровНМА()

// Процедура формирует проводку по принятию к учету НМА.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  НаборЗаписей			- РегистрБухгалтерииНаборЗаписей.бит_Дополнительный_2.
//  СтрокаТаблицы           - СтрокаТаблицыЗначений.
//  СтруктураКурсыВалют     - Структура.
//  СуммаПринятия			- Число.
//  СодержаниеДвижения		- Строка.
// 
Процедура СоздатьЗаписьПоПринятиюКУчету(СтруктураШапкиДокумента
									   ,НаборЗаписей
									   ,СтрокаТаблицы
									   ,СтруктураКурсыВалют
									   ,СуммаПринятия
									   ,СодержаниеДвижения)
	Если СуммаПринятия = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запись = НаборЗаписей.Добавить();
	
	// Заполнение атрибутов записи.
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", СтруктураШапкиДокумента.Организация);
	СтруктураПараметров.Вставить("Период"	  , СтруктураШапкиДокумента.Дата);
	СтруктураПараметров.Вставить("Валюта"	  , СтруктураКурсыВалют.Документ.Валюта);
	СтруктураПараметров.Вставить("СчетДт"	  , СтрокаТаблицы.СчетУчета);
	СтруктураПараметров.Вставить("СчетКт"	  , СтрокаТаблицы.КорСчет);
	СтруктураПараметров.Вставить("Сумма"	  , СуммаПринятия);
	СтруктураПараметров.Вставить("Содержание" , СодержаниеДвижения);
		
	бит_му_ОбщегоНазначения.ЗаполнитьЗаписьРегистраМУ(Запись,СтруктураПараметров);											   
	
	// Заполним аналитику счета Дт и Кт.
	бит_му_ОбщегоНазначения.ЗаполнитьАналитикуДт_Кт(Запись,СтрокаТаблицы,"Субконто","КорСубконто",мКоличествоСубконтоМУ);
	
	// Выполним валютные пересчеты.
	бит_му_ОбщегоНазначения.ВыполнитьВалютныеПересчетыЗаписи(СтруктураПараметров, Запись, СтруктураКурсыВалют);
		
КонецПроцедуры // СоздатьЗаписьПоПринятиюКУчету()

// Процедура формирует проводку по начислению ранней амортизации НМА.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  НаборЗаписей			- РегистрБухгалтерииНаборЗаписей.бит_Дополнительный_2.
//  СтрокаТаблицы           - СтрокаТаблицыЗначений.
//  СтруктураКурсыВалют     - Структура.
//  СуммаАмортизации		- Число.
//  СодержаниеДвижения		- Строка.
// 
Процедура СоздатьЗаписьПоНачисленюРаннейАмортизации(СтруктураШапкиДокумента
												   ,НаборЗаписей
												   ,СтрокаТаблицы
												   ,СтруктураКурсыВалют
												   ,СуммаАмортизации
												   ,СодержаниеДвижения)
	Если СуммаАмортизации = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запись = НаборЗаписей.Добавить();
	
	// Заполнение атрибутов записи.
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", СтруктураШапкиДокумента.Организация);
	СтруктураПараметров.Вставить("Период"	  , СтруктураШапкиДокумента.Дата);
	СтруктураПараметров.Вставить("Валюта"	  , СтруктураКурсыВалют.Документ.Валюта);
	СтруктураПараметров.Вставить("СчетДт"	  , СтруктураШапкиДокумента.СчетНРП);
	СтруктураПараметров.Вставить("СчетКт"	  , СтрокаТаблицы.СчетНачисленияАмортизации);
	СтруктураПараметров.Вставить("Сумма"	  , СуммаАмортизации);
	СтруктураПараметров.Вставить("Содержание" , СодержаниеДвижения);
		
	бит_му_ОбщегоНазначения.ЗаполнитьЗаписьРегистраМУ(Запись,СтруктураПараметров);											   
	
	// Заполним аналитику счета Кт.
	бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетКт, Запись.СубконтоКт, "НематериальныеАктивы", СтрокаТаблицы.НематериальныйАктив);
	
	// Выполним валютные пересчеты.
	бит_му_ОбщегоНазначения.ВыполнитьВалютныеПересчетыЗаписи(СтруктураПараметров, Запись, СтруктураКурсыВалют);
		
КонецПроцедуры // СоздатьЗаписьПоНачисленюРаннейАмортизации()

#КонецОбласти

#Область Инициализация

мКоличествоСубконтоМУ = 4;

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
